{"1077937": {"Content": "Title: Platemaker\nRequirement: Knowledge, Skills and Abilities:  Basic math aptitude; individual must know basic math skills and be able to read a ruler.  Ability to manage numerous projects simultaneously.  Demonstrates independent judgment.  High level of accuracy and attention to detail. Education and/or Experience: High School diploma or equivalent is required. Prior experience in printing/publishing is preferred but not necessary. ", "type": "Education", "Title": "Platemaker", "geo": "Atlanta GA US", "JobID": "1077937"}, "710382": {"Content": "Title: Commercial Collections - Transportation\nRequirement:  4-year college degree  SAP experience preferred Transportation industry experience", "type": "Education", "Title": "Commercial Collections - Transportation", "geo": "Atlanta GA US", "JobID": "710382"}, "196707": {"Content": "Title: Sales Assistant\nRequirement:  REQUIRED KNOWLEDGE, SKILLS AND ABILITIES   Must have strong organizational and time management skills. Must be detail oriented. Ability to read, analyze and interpret verbal and written requests and directions.  Must have the ability to compose emails and other written documentation clearly and concisely. Must have working knowledge of Windows operating system and be proficient in Microsoft software applications (i.e., Word, Excel, Outlook, and PowerPoint.).  Must have ability to learn and use company and customer system(s). Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals; compute rate, ratio and percent and to produce and interpret bar graphs. Ability to interpret a variety of situations and instructions furnished in written, oral, diagram, or schedule form.      REPORTING RELATIONSHIPS    Reports to a Supervisor or Manager    PHYSICAL DEMANDS   The demands described below are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.   Employee must have the ability to sit and/or stand at a desk for a minimum of 8 hours a day and complete tasks requiring repetitive use of hands. The employee must have the ability to lift and move items up to 15 pounds. Employee must have the ability to see written documents, computer screens and to adjust focus. This job is performed in a temperature controlled office environment.                To apply directly, please send your resume to MerylBerger@ClearChannel.com ", "type": "Education", "Title": "Sales Assistant", "geo": "Atlanta GA US", "JobID": "196707"}, "967582": {"Content": "Title: AP Coordinator\nRequirement:  Full cycle AP experience, must be in a large company, high volume environment (600-800 invoices/week) MUST have recent SAP experience (within a year) Any basic accounting experience-reconciliations, journal entries, etc. Strong data entry skills  all candidates will be tested Detail oriented, multi-tasker", "type": "Education", "geo": "Atlanta GA US", "JobID": "967582"}, "1091394": {"Content": "Title: Assistant Property Manager\nRequirement: See job Description", "type": "Education", "Title": "Assistant Property Manager", "geo": "Atlanta GA US", "JobID": "1091394"}, "815489": {"Content": "Title: Executive Assistant\nRequirement: Education and Experience At least 7 years experience providing support at the executive level Proficient computer skills and in-dept knowledge of relevant software such as MS Office Suite Knowledge of standard office administrative practices and procedures Bachelors degree an advantageKey Competencies Organizational and planning skills Communication skills Confidentiality Attention to detail and accuracy", "type": "Education", "Title": "Executive Assistant", "geo": "Atlanta GA US", "JobID": "815489"}, "902041": {"Content": "Title: Drivers - LOCAL Routes\nRequirement: MUST have a minimum of 2 years of commercial truck driving experience in a straight refrigerated box truck (or larger) with proficiency in operating a 6 speed standard transmission. CDL Class A is NOT required. Lifting 50 to 100 pounds. Clean 7 year MVR required. OT required including some weekends (every Saturday and alternating Sundays).Please do not apply if you do not meet the minimum requirements stated above.", "type": "Education", "Title": "Drivers - LOCAL Routes", "geo": "Atlanta GA US", "JobID": "902041"}, "170621": {"Content": "Title: Sales / Customer Service / Retail\nRequirement: see ad", "type": "Education", "Title": "Sales / Customer Service / Retail", "geo": "Atlanta GA US", "JobID": "170621"}, "409210": {"Content": "Title: Payroll Specialist\nRequirement:  Associate's degree is required; Bachelors degree is a plus 3+ years experience in a Corporate multi-state payroll environment processing 1000+ employees 2+ years of general accounting experience Experience using ADP is a must Experience with ADP reporting is strongly preferred Advanced Excel skills required (including pivot tables, v-lookups, macros) Excellent communication skills Strong attention to detail Good mathematical and calculation skills Strong work ethic with ability to think independentlySalary: CompetitivePosition istemporary with outstanding potential for permanent hire.As a temporary employee of SolomonEdwardsGroup, you will be eligible for these excellent benefits:Medical Benefits Holiday Pay Vacation Pay Direct Deposit or Total Pay Card 401(k) Savings Plan New Employee Referral Bonus Employee Assistance ProgramKeywords: Payroll Specialist, payroll, accounting, finance, construction, adpEqual Employment Opportunity (EEO)SolomonEdwardsGroup, LLC (SEG) is committed to a policy of equal opportunity in deciding all matters relating to employmentincluding hiring, compensation, training, advancement, transfer, promotion, discharge and all other terms and conditions of employment. SEG does not unlawfully discriminate on the basis of race, religion, color, gender, age, veteran status, non-disqualifying physical or mental disability, national origin or any other basis covered by law.", "type": "Education", "Title": "Payroll Specialist", "geo": "Atlanta GA US", "JobID": "409210"}, "874230": {"Content": "Title: Distribution Center Supervisor\nRequirement: The qualified candidate will have a successful background in a distribution production environment overseeing a minimum of 20 people. In addition, the successful candidate will preferably have a Bachelors Degree, a proven track record of accomplishments, and a people oriented attitude.", "type": "Education", "Title": "Distribution Center Supervisor", "geo": "Atlanta GA US", "JobID": "874230"}, "460488": {"Content": "Title: CUSTODIAN\nRequirement: A high school diploma/GED is requiredA minimum of one year of custodial experience performing the duties above is requiredStrong organizational abilities, follow up skills and attention to detailMaintain a high work ethic and take pride in the quality of workKnowledge of methods, materials and equipment used in custodial work; standard safe work practices, including occupational hazards and proper storing of equipment/materialsCapable of lifting up to 100 lbs. as needed \\n \\n \\n IMS offers a comprehensive compensation and benefits package that includes medical, dental, vision, Profit Sharing and 401(k), a generous paid time off policy and more!This position is not eligible for relocation assistance. Local candidates only please.IMS is an Equal Opportunity Employer", "type": "Location", "Title": "CUSTODIAN", "geo": "Atlanta GA US", "JobID": "460488"}, "790399": {"Content": "Title: Training Specialist\nRequirement: Education: Bachelors degree; Masters degree preferred in Training, Public Health or a related fieldExperience: Minimum 3 years experience in a training capacity Minimum 2 years experience in designing, developing and delivering practice management or EHR training programs to end users Experience working with medical practice management and/or electronic medical records systems. Experience with NextGen strongly desirable Experience with clinic operations and workflow preferred Work experience within the non-profit community health care system a plus NextGen Certified Professional certifications required within six months of start date This position requires the ability to work virtually and the ability to travel.To Apply: For consideration, qualified candidates should send a cover letter and resume withsalary history to: jobs@Voxent.org.", "type": "Education", "Title": "Training Specialist", "geo": "Atlanta GA US", "JobID": "790399"}, "260099": {"Content": "Title: A/R-Credit Collection Administrator\nRequirement: Qualifications are: Candidates should have a degree in related field (Accounting, Finance & Business Management) with a minimum of 5-years commercial credit/collection experience and National accounts experience required! Candidates must have strong communication skills for negotiation & reconciliation. Also, candidates must have solid organization and time management skills; with the ability to work effectively with all levels of management within the organization. Lastly, candidates must be proficient with Microsoft Excel and Word; SAP plus!", "type": "Education", "Title": "A/R-Credit Collection Administrator", "geo": "Atlanta GA US", "JobID": "260099"}, "190096": {"Content": "Title: Pick & Pack, Forklift, Data Modeler, Mailroom-*GA*\nRequirement: Qualifications:High School Diploma or GED0-2 years experienceFork lift drivers must have fork lift license", "type": "Location", "Title": "Pick & Pack, Forklift, Data Modeler, Mailroom-*GA*", "geo": "Atlanta GA US", "JobID": "190096"}, "202246": {"Content": "Title: Admin Assistant\nRequirement: Essential Requirements Proficiency in Microsoft Office Suite (Outlook, Word, Excel, PowerPoint). Gift processing experience is a must, preferably with the Raisers Edge software. Booking travel accommodations is a frequent task that is performed.  Communication skills, both written and verbal are a must since the dept. also works with external constituents. Must be a self-starter. Able to organize work, engage in a variety of tasks simultaneously and meet deadlines. Strong attention to detail. A Valid Georgia Drivers License is required. ", "type": "Education", "Title": "Admin Assistant", "geo": "Atlanta GA US", "JobID": "202246"}, "803091": {"Content": "Title: Territory Manager\nRequirement: Responsibilities:  Maximizes revenue and market share of Horizon Pharma products in territory and achieves/exceeds sales targets. Develops and maintains in-depth knowledge of the product, market and customers. Manages sales territory as a business to maximize sales. Analyzes the market dynamics to ensure territory sales goals are met. Develops and implements own territory business plan in line with corporate strategy and works within agreed budgets. Establishes and manages high quality customer relationships by maintaining knowledge of brand sales messaging, executing planned programs, scheduling and following-up with medical educational programs, and achieving or exceeding sales targets.  Makes compelling and persuasive sales calls to designated customers resulting in sales of Horizon products.  Sells products ethically and in accordance with the companys sales process and agreed marketing strategy. Adheres to all company and industry guidelines. Continuously develops and improves product knowledge, communication and selling skills through self learning and active participation in agreed training programs. Establishes and executes strategies required within a branded generic selling environment that will protect business generated The employee will be responsible for developing and implementing his/her own business plan.        Qualifications and Skills Required:  BA/BS required from 4 year accredited institution 2+ years of pharmaceutical sales experience preferred Documented Regional rankings in top 15% year over year Highly persuasive selling skills Strong work ethic Professional, proactive demeanor Maintaining a safe driving record Excellent verbal communication skills previous B2B selling experience required Strong preference for branded generic sales experienceStrong preference for relationships with existing customer baseEssential Core Competencies: Action Oriented Problem Solving Priority Setting Intellectual Horsepower Drive for Results Dealing with AmbiguityThe Territory Manager reports to the Area Business Manager (ABM). This position also needs to work with Horizon Clinical Field Personnel and Managed Markets Personnel.Position requires the ability to travel in short and long distances in a car or airplane, ability to lift weights up to 20 pounds, and some physical rigors are required such as arranging and carrying items from an automobile, mobility between office locations and setup of a theater style room for professional presentationsMust be able to store pharmaceutical product samples in a safe and PDMA compliant area within home office.", "type": "Education", "Title": "Territory Manager", "geo": "Atlanta GA US", "JobID": "803091"}, "475371": {"Content": "Title: Customer Service & Sales / Full Training\nRequirement: ALL MAJORS ARE ACCEPTED HOWEVER EXPERIENCE IN THE FOLLOWING MAJORS IS A PLUS:MARKETINGBUSINESSMANAGEMENTCOMMUNICATIONSBUSINESS ADMINISTRATIONSPORTS MARKETINGAll individuals must have:*PEOPLE SKILLS*STRONG WORK ETHIC*DESIRE FOR GROWTH*LEADERSHIP AND AMBITION*MUST HAVE OWN VEHICLEPAID TRAINING IS AVAILABLE....APPLY TODAY!NXDIRECT.ORG           NXDIRECT FACEBOOKrelated keywords: entry level, management, entry level management, entry level marketing, marketing, business development, entry level, customer service, sports minded, entertainment, advertising, public relations, management, sales, training, marketing, public relations, entry level, customer service, retail, entry level, full time, internship, management, advertising, public relations, entry level, public relations, business, marketing, entry-level, promotions, direct marketing, promotional sales, business development, entertainment, sales - marketing, management, clients, account manager, campaigns, marketing, direct advertising, client relations, retail, hospitality, marketing, experience, college graduates, internship, entry level, management, entry level management, entry level marketing, marketing, business development, entry level, customer service, sports, entertainment, advertising, public relations, management, sales, training, marketing, public relations, entry level, customer service, retail, restaurant, entry level, full time, internship, management, advertising, public relations Hiring Organization: NX Direct ", "type": "Education", "Title": "Customer Service & Sales / Full Training", "geo": "Atlanta GA US", "JobID": "475371"}, "909295": {"Content": "Title: Contract Billing/AR Coordinator\nRequirement: PARAMOUNT STAFFING, LLCFor immediate consideration, please send your resume directly to ddupuis@paramountstaffing.net or fax it to 404-760-4825.To learn more about Paramount Staffing, LLC visit our website at www.paramountstaffing.net.For more job opportunities, please visit our job board at http://paramountstaffing.easyjobboards.com/.Keywords: legal, legal secretary, paralegal, legal office support, in-house legal positions, legal receptionist, legal clerk,billing representative, accounting manager, billing, accounting, CMS,Aderant, Word, Excel, legal billing, legal billing representative, legal billing coordinator, billing coordinator, legalcoordinator", "type": "Education", "Title": "Contract Billing/AR Coordinator", "geo": "Atlanta GA US", "JobID": "909295"}, "1078744": {"Content": "Title: Receptionist / Administrative Assistant\nRequirement:  Bachelors degree preferred  1+ years in a corporate office environment and/or related experience  Strong knowledge of Microsoft Office, advanced Outlook skills required  Excellent written and verbal communication skills ", "type": "Education", "Title": "Receptionist / Administrative Assistant", "geo": "Atlanta GA US", "JobID": "1078744"}, "761456": {"Content": "Title: EXECUTIVE ASSISTANT\nRequirement:   5-10 years of Administrative Assistant (Fortune 500) experience  Heavy calendar management experience  Must be proficient in Outlook, Powerpoint, Word & Excel  Knowledge of Concur is helpful  Experience in working with C-level executives  Professional dress & demeanor a MUST  High energy, outgoing personality a MUST  Need to know when to make decision & when to ask Must be willing to work a long-term contract assignment    Must be able to pass a Criminal & Credit background All qualified candidates, please submit your resume TODAY. NO phone calls please!", "type": "Education", "Title": "EXECUTIVE ASSISTANT", "geo": "Atlanta GA US", "JobID": "761456"}, "138900": {"Content": "Title: Telecommunications Dispatcher\nRequirement: - Previous telecommunications experience- Excellent customer service skills- Must be computer literate- Good problem solving skills- The ability to work under pressure- Good time management skills- Escalate problems where needed- Handle site access details of Technicians- Ensure health and safety process is in place for all field activities- Be available to work a 24x7 work pattern- The right to live and work in the USATo apply for this position, please send a copy of yourresume to rebecca.scowen@projectpeople.com", "type": "Education", "Title": "Telecommunications Dispatcher", "geo": "Atlanta GA US", "JobID": "138900"}, "605322": {"Content": "Title: IT Support Specialist\nRequirement: Required SkillsMust have prior experience in an Architectural or Engineering firm or Contruction firm.  Associates Degree in Engineering, Computer Science, or technical trade school combined with one to two years of prior help desk and customer service experience. Preferred background in the architecture or engineering industry.  Extensive knowledge of Windows XP, Windows Vista, Microsoft Office 2007, Internet Explorer, and MS Outlook.  Knowledge of basic networking concepts and desktop troubleshooting. A+ Certification in desktop support. Familiarity with Macintosh OS X configuration including configuration and support of Entourage Email client in a corporate environment.  Ability to disconnect, lift and move PC's and Monitors (50 lbs) to new desks. Maneuver under counters and in tight spots to run cables and wires for PCs. Current knowledge of VoIP-based telephones, Windows Mobile and RIM-based PDAs is helpful. Occasional Travel to other offices in the South East.Salary is $50k to $70k Depending on Experience.", "type": "Location", "Title": "IT Support Specialist", "geo": "Atlanta GA US", "JobID": "605322"}, "264263": {"Content": "Title: Accounts Payable Specialist needed in Atlanta, GA - $15+/hr\nRequirement: Qualifications: Bachelors degree highly preferred 2-5 years of experience within high volume accounts payable required Knowledge of full cycle accounts payable required ERP experience required, Oracle experience preferredTo apply, please send updated resume to alexandramanolis@mergisgroup.com", "type": "Education", "Title": "Accounts Payable Specialist needed in Atlanta, GA - $15+/hr", "geo": "Atlanta GA US", "JobID": "264263"}, "254425": {"Content": "Title: Accounts Receivable Coordinator\nRequirement: Qualified Candidates should possess the following: At least 1-2 year of accounts receivable, billing, and/or accounts payable experience A clean background and good credit history Good problem solving and customer service skills  Excellent written and verbal communication skills and exceptional customer service skills Strong Excel skills", "type": "Education", "Title": "Accounts Receivable Coordinator", "geo": "Atlanta GA US", "JobID": "254425"}, "881717": {"Content": "Title: Claims Service Coordinator\nRequirement: Minimum Requirements:  Working knowledge of claims and familiarity with claims terminology.    3-5 Years experience in claims processing and analysis. Agency experience highly preferred.    Proficient with Microsoft Office products (Word, Outlook, Powerpoint); advanced Excel skills a MUST.    Experience with agency management system software (any) or AMS 360 a plus.    This position requires excellent written and oral communication skills and the demonstrated ability to organize and prioritize work.    Georgia insurance agent or adjusters license, in good standing, a plus    Must possess a high level of initiative and demonstrate the ability to work both independently and as a team with high productivity expectations in a fast paced environment. Extremely generous compensation package includes 100% employer paid group health plan, 401k plan with company match, paid time off, company paid holidays and unsurpassed profit sharing potential. Salary is negotiable, commensurate with experience. Send or Fax resume and salary history to careers@riskinsuranceco.com or 678.486.7076.References may be requested. Applicants that do not have indicated experience will NOT be considered.", "type": "Education", "Title": "Claims Service Coordinator", "geo": "Atlanta GA US", "JobID": "881717"}, "62246": {"Content": "Title: Hiring Immediately!\nRequirement: Requirements You must: Enjoy sales  Be able to deal with a fast paced work environment  Maintain knowledge of competitive offers  Provide excellent customer relations  Work under limited supervision  Be confident  Demonstrate good judgment and consistent professionalism while working with customers ", "type": "Education", "Title": "Hiring Immediately!", "geo": "Atlanta GA US", "JobID": "62246"}, "932547": {"Content": "Title: Restaurant / Hospitality / Retail Experience Wanted.\nRequirement: For more information on Veritas, Inc. please check our website:www.veritasatlanta.comDue to expansion, we are willing to train: Highly motivated people for management Marketing, and sales opportunities All openings are ideal for recent graduates, or professionals with marketing and sales experience looking for a career change because this is an entry level position in a brand new industry  Promotions are from within and based purely on merit.", "type": "Education", "Title": "Restaurant / Hospitality / Retail Experience Wanted.", "geo": "Atlanta GA US", "JobID": "932547"}, "196469": {"Content": "Title: Accounts Payable Specialist\nRequirement: Accounts Payable Specialist- Strong ERP experience.- Three to seven years of experience.", "type": "Education", "Title": "Accounts Payable Specialist", "geo": "Atlanta GA US", "JobID": "196469"}, "457044": {"Content": "Title: Regional Manager\nRequirement:  Bachelors degree required; CPM designation preferred  Must have at least 5-7 years of multi-site experience working with diverse assets (conventional, student housing and tax credit)  Highly skilled in customer service, all forms of communication, trend projection, report creation and financial management Previous experience successfully building teams where a sense of ownership and personal responsibility led to the desired resultsBenefits:We value our employees time and efforts. Our commitment to your success is enhanced by our competitive compensation and extensive benefits package including healthcare, 401(k), long-term and short-term disability, paid holidays and life insurance.Most importantly, we offer a fun, positive working environment that is challenging and stimulating. We strive to provide a collaborative, creative environment where each person feels encouraged to contribute to our processes, decisions, planning and culture.To Apply: To respond to this opportunity, please send your resume to recruiting1575@gmail.com. Please include Regional Manager Atlanta in the subject line.EOEKeywords: apartment leasing agent, apartment complex, lease, rental, residential property manager", "type": "Education", "Title": "Regional Manager", "geo": "Atlanta GA US", "JobID": "457044"}, "1037735": {"Content": "Title: Warehouse Worker-*GA*\nRequirement: Qualifications: -2 yrs of Experience. Ability to read and interpret sales orders and work orders. Ability to safely operate a forklift, forklift license required. Flexibility with regard to job assignments.Must be proficient in using a computer and able to use various computer applications; SAP or Cincom experience preferred. Ability to lift 30 pounds. ", "type": "Location", "Title": "Warehouse Worker-*GA*", "geo": "Atlanta GA US", "JobID": "1037735"}, "790697": {"Content": "Title: Executive Assistant\nRequirement:  Property Managementexperience is a plus Quick learner, accuracy and attention to detail are critical Excellentcommunication skills. To perform this job successfully, an individual should have a strong knowledge of computer software including, but not limited to, Microsoft Excel, Word and Outlook. Bilingual is a plus", "type": "Education", "Title": "Executive Assistant", "geo": "Atlanta GA US", "JobID": "790697"}, "95122": {"Content": "Title: Call Center\nRequirement:  Experience with TRAC    Good communication skills both written and verbal    Professional appearance and work ethic    Superior customer service skills    Strong mathematical ability Required Education:  High school diploma or the equivalent*All applicants must pass pre-employment testing to include: background checks, MVR, and drug testing in order to qualify for employment* Compensation and Benefits:In addition to competitive pay, we offer our associates:  Group health    Dental    Vision, Life, Disability insurance    401(k) plan with company match    Paid vacation    Employee Stock Purchase Plan    Employee Vehicle Purchase Program    Professional work environment, with job training and advancement opportunities If you are in alignment with our values of integrity, transparency, professionalism and teamwork- now might be the time for you to accelerate your career as part of the best company in automotive retail. Apply today or refer a qualified friend. Group 1 Automotive is an Equal Employment Opportunity employer. ", "type": "Education", "Title": "Call Center", "geo": "Atlanta GA US", "JobID": "95122"}, "333399": {"Content": "Title: Online P&C Rating Coordinator\nRequirement: Candidates must have at least three years of P&C; insurance experience and one year rating experience.Must be computer savvy, strong PC skills, willingness to embrace technology, - Great personality and customer service skills- Excellent communication and follow-through- Computer savvy and a willingness to embrace technology- Self-motivated, excellent phone voice- Excellent written and verbal communication skills", "type": "Education", "Title": "Online P&C Rating Coordinator", "geo": "Atlanta GA US", "JobID": "333399"}, "553828": {"Content": "Title: Receptionist\nRequirement: **SEE ABOVE", "type": "Education", "Title": "Receptionist", "geo": "Atlanta GA US", "JobID": "553828"}, "296865": {"Content": "Title: Entry Level Inside Sales - Rental Sales Agent\nRequirement: Entry Level Inside Sales - Rental Sales AgentRental Sales Objectives:  Implement a rental sales and telemarketing plan.  Develop and use a systematic approach to rental sales calls utilizing telemarketing and mailers.  Maintain relationships with large volume rental customers and their employees.  Maintain a customer/prospect sales database. If youare interested in a great salesopportunity, we encourage you to click APPLY NOW!Related terms: Outside Sales Representative, Sales Executive, Inside Sales Representative, Account Representative, Outside Sales, Sales Account Executive, Sales Associate, Sales Consultant, Sales Rep Keyword search: sales, marketing, market, sell,manager,telephone, telesales, inside sales rep. trainee, commission, unlimited, entry level,opportunity, opportunities, selling,salesperson, salesman, automobiles, cars, trucks, computer, internet,inside, representative, salespeople, speaker, real estate, mobile homes, homes, house, marketing, Outside Sales Representative, Sales Executive, Inside Sales Representative, Account Representative,Sales Account Executive, Sales Associate, Sales Consultant, Sales Rep ", "type": "Education", "geo": "Atlanta GA US", "JobID": "296865"}, "819687": {"Content": "Title: Call Center Manager\nRequirement: EXPERIENCE AND REQUIRED SKILLS  Two or more years managing others, high volume call center experience preferred.   Experience managing outbound telemarketers preferred.   Strong leadership and motivational skills.   Ability to prioritize and adapt to a fast paced team oriented environment.   Proven ability to manage others, show initiative and think outside the box.   Sound judgment in decision making ability.   Excellent interpersonal skills.  Flexibility with working hours, which may include hours outside of normal scheduled work hours  Call Center Manager ", "type": "Education", "Title": "Call Center Manager", "geo": "Atlanta GA US", "JobID": "819687"}, "152527": {"Content": "Title: Administrative Assistant\nRequirement: - Bachelors degree required - Strong verbal and written skills - Ability to handle several projects simultaneously For immediate consideration, please sumbit a Word copy of your resume to [Click Here to Email Your Resum] or select Apply Now.Keywords: Administrative assistant, legal assistant, executive assistant, office assistant", "type": "Education", "Title": "Administrative Assistant", "geo": "Atlanta GA US", "JobID": "152527"}, "11624": {"Content": "Title: Field Technician\nRequirement: We offer an excellent salary, paid expenses and many attractive benefits. Heavy travel is involved in the position. Overtime (about 10 hrs a week is paid at time and one half) - position can be based in Jackson Mississippi, Birmingham Alabama, Nashville Tennessee, Louisville Kentucky, Charlotte North Carolina, Atlanta Georgia or surrounding areas.", "type": "Location", "Title": "Field Technician", "geo": "Atlanta GA US", "JobID": "11624"}, "152528": {"Content": "Title: Office Assistant\nRequirement: At least 1-2 years working in office support and operationsIntermediate skills in Microsoft Office products and social mediaExcellent communication skills, both written and verbalKeywords: Administrative Assistant, Office Assistant, Receptionist", "type": "Education", "Title": "Office Assistant", "geo": "Atlanta GA US", "JobID": "152528"}, "39029": {"Content": "Title: Entry Level Sales Representative\nRequirement: As a Leasing Sales Representative with CLASS, you must be very organized, possess superb written and verbal communication skills and superior customer service abilities, both in person and over the phone. You must be able to excel in a professional, performance-driven, fast and fun team environment where the only limit to your success is yourself. You must be reliable and demonstrate a strong work ethic. Additional requirements for the Leasing Sales Representative include:  Minimum 1 year leasing and/or sales experience    Computer and social media literacy    Having strong persuasion skills    Bilingual Spanish abilities preferred Leasing Sales Representative - Outside Sales Representative BenefitsAt CLASS, we understand that our Leasing Sales Representatives work hard, so we offer a competitive base salary with opportunities to increase your earning potential through a rewards point system, as well as an excellent commission. We also offer a generous benefits package, two weeks paid vacation every 45 days andtravel expenses paid while on assignment! Additional benefits for the Leasing Sales Representatives include: Health and dental insurance  401(k) retirement insurance  Corporate apartment and rental car when on-site for assignment  Extensive and ongoing training and development  Support from the top management team in the industry  Career advancement opportunities ", "type": "Education", "geo": "Atlanta GA US", "JobID": "39029"}, "872036": {"Content": "Title: Attention Waitresses & Waiters!\nRequirement: Must be energetic and self motivated.\\n", "type": "Location", "Title": "Attention Waitresses & Waiters!", "geo": "Atlanta GA US", "JobID": "872036"}, "843399": {"Content": "Title: CI01 - Contact Center Customer Service Inbound/Outbound I\nRequirement: ", "type": "Location", "Title": "CI01 - Contact Center Customer Service Inbound/Outbound I", "geo": "Atlanta GA US", "JobID": "843399"}, "317343": {"Content": "Title: Customer Service Representatives $17.50-$23 per hr.\nRequirement:  Exceptional listening and analytical skills High school diploma or higher 3 months call center experience Professional oral, written and interpersonal communication skills Dedication to providing exceptional customer service Excellent organizational skills Ability to multi-task effectively Strong knowledge of benefits and customer service processes Ability to function independently with little supervision Ability to project a positive attitude Effectively communicate new ideas and implement when appropriate Effectively interact with all levels of contactsPlease submit your resume tosarahg@jobfindersnetwork.comApplicants must be ready to review calls in a call center as part of the application processPeople from following backgrounds are encouraged to apply as multiple and a variety of positions are available!administrative assistant clerical, sales managers, Customer Service Representative, Telephone Customer Support, telecommunications, marketing, inside sales, consulting.Keywords: Customer Service Admin/ Clerical Technical Support Telemarketing Manufacturing Sales Telephone Sales Representative, Inside Sales Representatives, Call Center, Entry Level Support, work from home, work at home, entry level.", "type": "Education", "Title": "Customer Service Representatives $17.50-$23 per hr.", "geo": "Atlanta GA US", "JobID": "317343"}, "779460": {"Content": "Title: Administrative Assistant\nRequirement: Administrative AssistantEssential Skills & Experience: High school diploma or general education degree (GED); and related experience and/or training.    Proficient knowledge of MS Office Suite (e.g., Word, Excel, PowerPoint, Outlook).    Ability to use systems to acquire the necessary data. ProLogis offers a competitive salary, a comprehensive selection of benefit options, including 401(k) with company match.All job offers are contingent upon successful completion of drug screen and background verification.ProLogis is an Equal Opportunity/Affirmative Action Employer", "type": "Education", "Title": "Administrative Assistant", "geo": "Atlanta GA US", "JobID": "779460"}, "502743": {"Content": "Title: Quality Compliance Associate\nRequirement: High School graduate, with some college education preferred. Must be able to read, write and communicate effectively in English. Some prior Quality Assurance experience in the medical device field required  specific training will be provided on site. Candidate must also be able to pass background screening and drug testing. ", "type": "Education", "Title": "Quality Compliance Associate", "geo": "Atlanta GA US", "JobID": "502743"}, "757625": {"Content": "Title: Customer Service Representative\nRequirement: Please refer to the Job Description to view the requirements for this job", "type": "Education", "Title": "Customer Service Representative", "geo": "Atlanta GA US", "JobID": "757625"}, "634994": {"Content": "Title: Sales & Operations Manager\nRequirement: -", "type": "Education", "Title": "Sales & Operations Manager", "geo": "Atlanta GA US", "JobID": "634994"}, "254815": {"Content": "Title: Entry Level Career Opportunities\nRequirement: Position Requirements An outgoing, professional, open-minded, and positive attitude is a must    A high energy personality    Candidates must be able to pass both a background and drug screen This is an outstanding opportunity for recent college grads or those looking to make a change in their careers to a more stable position with greater advancement opportunity. Internships are available for qualified students. We will be responding to your resume immediately if selected for an interview. We apologize, but we can only contact those we select to meet in person.Thank you for your interest in C4!key words: customer service, entry level, management, marketing, sales, account executive, advertising, sports, promotions People from all backgrounds seeking full time opportunities or internships in the following areas are encouraged to inquire about our program: sales, customer service, part time, manager, accounting, marketing, clerical, management, pr, computer, engineer, human resources, driver, security, administrative assistant, purchasing, medical, administrative, receptionist, retail, maintenance, warehouse, sports teams, entry level, education, finance, director, telecommunications, real estate, training, engineering, insurance, data entry, project manager, information technology, part time, printing, technician, legal, automotive, teacher, winter, banking, analyst, nursing, restaurant, controller, network, public relations, environmental, nurse, design, quality, safety, secretary, office, assistant, hotel, accountant, account executive, vice president, medical assistant, transportation, supervisor, general, public relations, advertising, writer, fraternity, social services, finance, java, all, graphic, public relations, mba, holiday, office manager, sales manager, field representative, mortgage, social work, training, cms, attorney, research, payroll, oracle, executive assistant, paralegal, courier post, drivers, pharmaceutical, operations, president, web, help wanted, rn, advertising, law enforcement, autocad, health care, executive, food, production, chef, sports oriented, cad, project management, tax, auto, editor, hospitality, hvac, training, team player, pharmaceutical sales, tourism, it, collections, spanish, unix, art, buyer, facilities, professional, mechanical, bartender, help desk, hospitality, travel, logistics, call center, truck driver, inventory, financial analyst, computers, communications, pharmacist, police, teaching, counselor, chemist, plant manager, ncaa, photography, promotional advertising, bookkeeper, medical sales, electrical engineer, health, trader, bilingual, business analyst, recruiter, junior executive, cfo, accounts payable, account manager, sports, sorority, cashier, financial, music, social worker, publishing, project, support, business development, lpn, welder, clerk, technical, quality assurance, promotional sales, government, distribution, secretarial, sales management, mental health, nanny, child care, registered nurse, cna, japanese, technical support, administration, property manager, cook, shipping, pharmacy, coordinator, entertainment, management training, new grads.", "type": "Education", "Title": "Entry Level Career Opportunities", "geo": "Atlanta GA US", "JobID": "254815"}, "868804": {"Content": "Title: Administrative Assistant II (National Accounts Atlanta GA) - 560\nRequirement: Requires a HS diploma or GED;4 + years administrative experience, or any combination of education and experience, which would provide an equivalent background. BA/BS degree preferred. ", "type": "Location", "Title": "Administrative Assistant II (National Accounts Atlanta GA) - 560", "geo": "Atlanta GA US", "JobID": "868804"}, "554851": {"Content": "Title: Entry Level Career Opportunities\nRequirement: Position Requirements An outgoing, professional, open-minded, and positive attitude is a must    A high energy personality    Candidates must be able to pass both a background and drug screen This is an outstanding opportunity for recent college grads or those looking to make a change in their careers to a more stable position with greater advancement opportunity. Internships are available for qualified students. We will be responding to your resume immediately if selected for an interview. We apologize, but we can only contact those we select to meet in person.Thank you for your interest in C4!key words: customer service, entry level, management, marketing, sales, account executive, advertising, sports, promotions People from all backgrounds seeking full time opportunities or internships in the following areas are encouraged to inquire about our program: sales, customer service, part time, manager, accounting, marketing, clerical, management, pr, computer, engineer, human resources, driver, security, administrative assistant, purchasing, medical, administrative, receptionist, retail, maintenance, warehouse, sports teams, entry level, education, finance, director, telecommunications, real estate, training, engineering, insurance, data entry, project manager, information technology, part time, printing, technician, legal, automotive, teacher, winter, banking, analyst, nursing, restaurant, controller, network, public relations, environmental, nurse, design, quality, safety, secretary, office, assistant, hotel, accountant, account executive, vice president, medical assistant, transportation, supervisor, general, public relations, advertising, writer, fraternity, social services, finance, java, all, graphic, public relations, mba, holiday, office manager, sales manager, field representative, mortgage, social work, training, cms, attorney, research, payroll, oracle, executive assistant, paralegal, courier post, drivers, pharmaceutical, operations, president, web, help wanted, rn, advertising, law enforcement, autocad, health care, executive, food, production, chef, sports oriented, cad, project management, tax, auto, editor, hospitality, hvac, training, team player, pharmaceutical sales, tourism, it, collections, spanish, unix, art, buyer, facilities, professional, mechanical, bartender, help desk, hospitality, travel, logistics, call center, truck driver, inventory, financial analyst, computers, communications, pharmacist, police, teaching, counselor, chemist, plant manager, ncaa, photography, promotional advertising, bookkeeper, medical sales, electrical engineer, health, trader, bilingual, business analyst, recruiter, junior executive, cfo, accounts payable, account manager, sports, sorority, cashier, financial, music, social worker, publishing, project, support, business development, lpn, welder, clerk, technical, quality assurance, promotional sales, government, distribution, secretarial, sales management, mental health, nanny, child care, registered nurse, cna, japanese, technical support, administration, property manager, cook, shipping, pharmacy, coordinator, entertainment, management training, new grads.", "type": "Education", "Title": "Entry Level Career Opportunities", "geo": "Atlanta GA US", "JobID": "554851"}, "373102": {"Content": "Title: Executive/Personal Assistant\nRequirement: Demonstrated experience assisting a C-level executiveBachelors degree preferred or related experienceOutstanding interpersonal, written, and oral communications skillsInitiative and sound judgmentProactive and highly professional demeanorDetail oriented with high level of accuracy and follow throughStrong coordinating, multi-tasking and problem solving skillsAbility to work in an extremely fast paced environmentAbility to prioritize, manage time efficiently, and manage to deadlinesAbility to communicate clearly and directly, accept constructive criticism, and deal with intense personalities Willing to work flexible and some long hours", "type": "Education", "Title": "Executive/Personal Assistant", "geo": "Atlanta GA US", "JobID": "373102"}, "464652": {"Content": "Title: CUSTOMER SERVICE REP NEEDED ASAP\nRequirement: Qualifications:\\n\\nAbility to communicate clearly and professionally with customers and coworkers\\nHigh level of accuracy, attention to detail and able to manage multiple tasks in a fast-paced environment\\nStrong math and written communication skills\\nHigh level of ownership, accountability and initiative\\nAbility to work a flexible schedule based on department and store needs", "type": "Education", "Title": "CUSTOMER SERVICE REP NEEDED ASAP", "geo": "Atlanta GA US", "JobID": "464652"}, "247250": {"Content": "Title: Receptionist / Administrative Assistant\nRequirement:  Bachelors degree preferred  1+ years in a corporate office environment and/or related experience  Strong knowledge of Microsoft Office, advanced Outlook skills required    Excellent written and verbal communication skills   ", "type": "Education", "Title": "Receptionist / Administrative Assistant", "geo": "Atlanta GA US", "JobID": "247250"}, "560006": {"Content": "Title: Restaurant Managers Casual Family & Fast Food! GM & Assistants\nRequirement: Our Client hires only the best! Minimum 2 years experience as salaried restaurant manager Record of maintaining high standards in restaurant cleanliness, sanitation, food quality, and guest satisfaction Demonstrated leadership skills, including coaching, directing, and motivating a team Dependable and Loyal Some exposure to P&L; and Sales Building a plus MOST IMPORTANTLY - A strong work ethic with a desire to learn, grow, succeed, and HAVE FUN!", "type": "Education", "geo": "Atlanta GA US", "JobID": "560006"}, "280565": {"Content": "Title: Network Operator – Tier II\nRequirement: Required SkillsUnderstanding of the importance of customer service and the willingness to provide it dailyAbility and desire to both work and learn Strong verbal and written communication skills Must be punctual and attend work reliablyAbility to effectively prioritize and multitaskAbility to build and maintain strong working relationships with other internal departmentsAbility to work with a sense of urgency when addressing network outagesAbility to work with others in stressful situationsAbility to troubleshoot hardware and software issues in a network communications environmentMust be familiar with Microsoft OS (Windows 98 and up)Must be experienced in the use of the Microsoft Office Suite (Word, Excel, Visio, etc.)Technical CapabilityStrong familiarity with Layer 2 and 3 IP network components (switches, routers, etc)Ability to interface with L2/3 IP components to configure, manage and troubleshootStrong familiarity with RF technology fundamentalsHands on experience with VSAT systems from and installation and support perspectiveExperience with autodeploy VSAT system platforms (SeaTel, Winegard, AVL, etc)Demonstrative capability to define various elements of a VSAT systemFamiliarity with RF teleport equipment such as HPAs, LNAs, Up/Down ConvertersExperience with the iDirect satellite communications platform a plusUnderstanding of and ability to troubleshoot DNS issuesUnderstanding of and ability to calculate IP subnetsUnderstanding of and ability to troubleshoot VoIP in the Asterisk VoIP environmentUnderstanding of and ability to troubleshoot SMTP, POP and IMAPUnderstanding of and ability to troubleshoot IP VLANs and VLAN switchesExperience troubleshooting terrestrial circuit outages and interfacing with telco call centersWorking knowledge of UNIXUnderstanding of MPLS and BGP considered a plusExperience with the Riverbed product suite considered a plusProficiency scripting in Perl considered a plusExperience working with databases considered a plusEducation/CertificationsHigh School diploma with at least 2 years experience or a College degree in a related technologyCisco CCNA certification a plus", "type": "Location", "Title": "Network Operator – Tier II", "geo": "Atlanta GA US", "JobID": "280565"}, "400568": {"Content": "Title: Sports and Entertainment Marketing - Entry Level Advertising\nRequirement: NexGen Managementwill provide individuals with excellent leadership, guidance, a competitive merit based compensation, and a challenging career path. This is an entry level position so college graduates or people looking to get their foot in the door are encouraged to apply. Candidates must represent the following:  Excellent communication skills  Leadership experience  Ability to work in a high energy environment  Ambition, strong work ethic, and open to new ideas  Be a self-starter with problem solving skills  Be a career oriented individual College grads and interns are also encouraged to apply. For immediate consideration please submit resumes online.related keywords: entry level, management, entry level management, entry level marketing, marketing, business development, entry level, customer service, sports minded, entertainment, advertising, public relations, management, sales, training, marketing, public relations, entry level, customer service, retail, restaurant experience, entry level, full time, internship, management, advertising, public relations, entry level, public relations, business, marketing, entry-level, promotions, direct marketing, promotional sales, business development, entertainment, sales - marketing, management, clients, account manager, campaigns, marketing, direct advertising, client relations, retail, hospitality, marketing, experience, college graduates, internship, entry level, management, entry level management, entry level marketing, marketing, business development, entry level, customer service, sports, entertainment, advertising, public relations, management, sales, training, marketing, public relations, entry level, customer service, retail, restaurant, entry level, full time, internship, management, advertising, public relations--  ", "type": "Education", "geo": "Atlanta GA US", "JobID": "400568"}, "145170": {"Content": "Title: Operations Manager\nRequirement: Qualifications and Skills BS in Business and or related field.    5 years of Janitorial / Landscaping or related service field    Breadth of experience in building operations, service management, supplies ordering, and inventory management is preferred.    Must have a minimum of 4 years supervisory experience    Must have some client relations and/or account management experience.    Must be familiar with the processes and requirements of refinishing wood, stone, and metal    Excellent technical, interpersonal, and analytical skills required.    Excellent written and oral communications skills.    Project management, planning, and construction accounting skills are necessary.    Computer skills needed include spreadsheets, MS-Office, MS-Outlook    OSHA10 or higher certification.    Must willing and able to work Swing shifts. ", "type": "Education", "Title": "Operations Manager", "geo": "Atlanta GA US", "JobID": "145170"}, "749031": {"Content": "Title: Accounts Payable Administrator\nRequirement: Wants someone who can review all invoices for appropriate documentation and approval prior to payment.", "type": "Education", "geo": "Atlanta GA US", "JobID": "749031"}, "1010073": {"Content": "Title: Staff Accountant\nRequirement:  Qualifications: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Education and/or Experience: Bachelors degree from a four year college or university or equivalent preferred; one to two years related experience and/or training; or equivalent combination of education and experience.", "type": "Education", "geo": "Atlanta GA US", "JobID": "1010073"}, "177507": {"Content": "Title: Assistant Manager\nRequirement: Job Requirements:At least 3 years of experience in a $2 Million restaurantAn understanding of cost controls A team player attitude - a natural leaderA passion for hospitality", "type": "Education", "Title": "Assistant Manager", "geo": "Atlanta GA US", "JobID": "177507"}, "509715": {"Content": "Title: Real Estate Representative\nRequirement: REQUIREMENTS Bachelors degree in Real Estate, Business or Finance and/or combination of 5+ years of relevant experience in Real Estate, Leasing or Development. Proficient with Excel, Word and Outlook. Proficient with reading and understanding (construction) plans, leases and regulations.", "type": "Education", "Title": "Real Estate Representative", "geo": "Atlanta GA US", "JobID": "509715"}, "702760": {"Content": "Title: Installation Supervisor\nRequirement: Installation Supervisor Requirements - Installation Supervisor: Master Electrician license.    Minimum of 5 years experience in the installation of digital/hydraulic governors, automation, SCADA systems, excitation systems, power transformers and switchgear.    Minimum 10 years experience as a construction site superintendent    Knowledgeable in all aspects of construction including technology, equipment, methods, field engineering, materials, safety, and scheduling.    Understanding of OSHA, Safety and First Aid procedures. Maintain current Red Cross First Aid and CPR certification.    Ability to pass Department of Homeland Security background check, customer required criminal background check and random drug tests.    Understanding and experience with hydraulic piping and systems (150 to 2000psi).    Understanding and experience with mechanical construction and systems.    Understanding and experience with 24VDC, 125VDC and 120VAC control.    Understanding and experience with 480V, 4160V and 13.8KV power.    Able to perform all essential functions of the job.    Ability to travel up to 75% domestically and internationally DESIREABLE Hydroelectric power plant site knowledge    Familiar with ASME, IEEE, IEC, NEC, and CSA standards applicable to the installation of equipment and auxiliaries intended for Power Generating Stations OTHER REQUIREMENTS:  Ability to confidently correspond with customers via oral and written means    Ability to motivate and inspire personnel to keep project moving toward successful completion    Ability to travel to Canada    Ability to work independently and in a team environment with minimal supervision    Able to wear personal protective equipment; hearing protection, hard hat, safety glasses, etc.    Authorized to accept employment in U.S.    Be a self-starter, effectively perform duties without guidance    Display a positive can do attitude    Excellent customer relations skills    Fluent in English language    High level organizational skills with ability to set priorities, manage multiple deadlines and work under pressure    Possess a strong attention to detail    Possess strong electrical and mechanical aptitude    Proficient use of personal computer, operating knowledge of Microsoft Word, Excel and Project    Shall sign L&S; Electric confidentiality agreement    Shall work as required to complete work requirements    Simultaneously execute multiple projects    Strong communication skills, ability to correspond confidently with customers and project team    Valid drivers license, able to be insured    Valid passport or ability to obtain one    When on call, respond to customer service calls 24 hours a day, 7 days a week    Willingness to learn new skills and approaches to dealing with problems    Work effectively as an individual and in a team environment WORKING CONDITIONS:  Aerial work may sometimes be necessary    Core working hours are 8AM to 5PM unless prior approval given    Environmental conditions vary from facility to facility (i.e. heat, noise)    Occasional lifting of heavy objects    Uneven or slippery walking surfaces    Work from assigned L&S; office unless prior approval given    Work is performed at the customer jobsite as well as at L&S; Electric facilities. Key Words : maintenance, facilities, landlord, building super, super, facilities maintenance ", "type": "Education", "Title": "Installation Supervisor", "geo": "Atlanta GA US", "JobID": "702760"}, "464856": {"Content": "Title: Campaign Specialist - Retail Marketing Events\nRequirement:  Retail or service sales experience preferred, however training is provided Excellent customer service, communication and organization skills Ability to work in a fast-paced, high-energy environment and utilize good judgment. Ability to build and maintain client and customer relationships Present a professional appearance and maintain grooming standards and dress code. Ability to work nights and weekendsPlease feel free to check our website at www.thenewelement.netLIKE us on Facebook! www,facebook.com/newelementincThank you for your application, a member of the HR Dept. will be contacting qualified applicants within 72 hours of receipt of their application. No attachments please.", "type": "Education", "geo": "Atlanta GA US", "JobID": "464856"}, "547357": {"Content": "Title: Office Assistant Needed for Perimeter\nRequirement: At least 1-2 years working in office support and operations.Intermediateskills in Microsoft Office products.Excellent communication skills, both written and verbal.", "type": "Education", "Title": "Office Assistant Needed for Perimeter", "geo": "Atlanta GA US", "JobID": "547357"}, "908618": {"Content": "Title: Project Coordinator - Telecommunications\nRequirement: We offer an excellent salary and many attractive benefits. To arrange a local interview submit your resume in confidence.", "type": "Education", "Title": "Project Coordinator - Telecommunications", "geo": "Atlanta GA US", "JobID": "908618"}, "158623": {"Content": "Title: Director of Operations\nRequirement:  Experience managing large convention hotels or conference centers    A Global Strategic Thinker    Someone who has managed Multiple Revenue Streams    Experienced in Long-Term Planning    Strong interpersonal skills who can manage a large diverse management team    Ability to manage up and push back as necessary ", "type": "Education", "Title": "Director of Operations", "geo": "Atlanta GA US", "JobID": "158623"}, "639471": {"Content": "Title: Corporate Recruiter\nRequirement: Bachelors degree preferred, but will accept equivalent work experienceMust be able to travel 60-70%Proven track-record in high volume recruiting. We recognize that talented people are attracted to companies that provide competitive pay, comprehensive benefits packages and outstanding advancement opportunitiesemployment@jasperinc.org Equal Opportunity EmployerDrug-Free Workplace", "type": "Education", "Title": "Corporate Recruiter", "geo": "Atlanta GA US", "JobID": "639471"}, "927736": {"Content": "Title: Night Laundry / Guest Services Representative\nRequirement: Guest Services Agent - Night / Front Desk / Customer Service EDUCATION and/or EXPERIENCE: High school diploma or general education degree (GED); or one to three months related experience and/or training; or equivalent combination of education and experience.", "type": "Education", "Title": "Night Laundry / Guest Services Representative", "geo": "Atlanta GA US", "JobID": "927736"}, "457596": {"Content": "Title: General Manager\nRequirement:  At least 5 years of management experience, with some of it preferably in an automotive dealership environment. Strong strategic orientation. Motivated and results-oriented. Builds strong relationships with customers, peers, and subordinates. Capable of quickly confronting and resolving performance and other personnel issues. ", "type": "Education", "Title": "General Manager", "geo": "Atlanta GA US", "JobID": "457596"}, "886133": {"Content": "Title: Regulatory Administrative Assistant\nRequirement: The ideal candidate will have the following skills: Oncology experience Great interpersonal skills Strong communication skills Detail oriented Motivated, self-starterExperience/education: Bachelors degree preferred but not required, proficient in medical terminology, study coordinator experience, research regulatory coordination experience or equivalent experience required. ", "type": "Education", "Title": "Regulatory Administrative Assistant", "geo": "Atlanta GA US", "JobID": "886133"}, "1053896": {"Content": "Title: Generator Field Service Technician\nRequirement: Generator Field Service TechnicianAll applicants: Active, current drivers license and clean driving record    Pass criminal background check    Pass mandatory drug screening    College or Technical education is a plus If hired, employee will be provided a company vehicle to be used for service work. Benefits include, but are not limited to: 10 days paid vacation per year    5 days paid sick leave per year    Nine paid Holidays    Overtime past 40 hours    Double time for billable work on the weekends and holidays    Medical, Dental, Life Insurance, LTD, 401K is available Please apply via Career Builder for this position No Phone CallsContact Information: Jean Campbell", "type": "Education", "Title": "Generator Field Service Technician", "geo": "Atlanta GA US", "JobID": "1053896"}, "600010": {"Content": "Title: Receptionist/Admin. Assistants/Customer Service\nRequirement: Please refer to the Job Description to view the requirements for this job", "type": "Education", "Title": "Receptionist/Admin. Assistants/Customer Service", "geo": "Atlanta GA US", "JobID": "600010"}, "1050736": {"Content": "Title: Executive Assistant\nRequirement: Requirements:Experience reporting to a C-level executive.Professional image and communication skills.Strong Word, Excel and PowerPoint skills.Stable work history.Superb references.", "type": "Education", "Title": "Executive Assistant", "geo": "Atlanta GA US", "JobID": "1050736"}, "916294": {"Content": "Title: AP Specialist\nRequirement: Minimum 2 years full cycle AP. Oracle 11i and/or R12. Thorough knowledge of financial chart of accounts and corporate procedures.High School Diploma or Equivalent, college courses in accounting preferred.Proficient in Excel and Word, 10-key by touch.Detail oriented, reliable.Excellent verbal and written communication skills. Ability to interact with employees and vendors in a professional manner.Strong work ethics.Strong organizational and time management skills.Ability to work independently and with a team in a fast-paced and high volume environment with emphasis on accuracy and timliness.Must have strong problem solving skills, research and resolution skills, and multi-tasking skills.", "type": "Education", "Title": "AP Specialist", "geo": "Atlanta GA US", "JobID": "916294"}, "406695": {"Content": "Title: Managing Partner / Executive Consultant / Medical Sales\nRequirement: Applicant must possess a(n): Businesslike, mature, professional appearance and demeanor Commanding personality capable of leadership Strong grasp of the fundamentals of marketing Minimum 3 years professional sales experience for Executive Sales Consultants Minimum 7 years highly successful business experience for Regional Managing Partners Comfort with group presentations Ease of working with senior level business executives and professionals Ability to communicate effectively and persuasively in both oral and written forms  Discipline to work from a home office High degree of personal confidence Non-compromising need for top-level earnings Strong desire for helping consumers solve their most vexing health problems Ability to demonstrate past accomplishment of worthy goals Need for a position that offers significant opportunity for advancement & personal growth Track record of ethical behavior  Psychological profile that meets company requirementWe offer Qualified Successful Candidates: Top level earnings  Weekly earnings Monthly bonuses Expense paid trips to Costa Rica Opportunity for advancement and career growthAdditional benefits available exclusively to Regional Managing Partners: Override earnings from Executive Sales Consultant activities An opportunity to build equity and net worth Private club allowance ($500/mo) Luxury automobile allowance ($1000/mo) Executive home office allowance ($5000/mo)For consideration, qualified applicants may contact:USAcareers@WiseMDs.comAttention: Anthony KingExecutive Vice PresidentVice President Sales & Marketing North AmericaWorld Institute of Surgical ExcellencewiseMDs.com", "type": "Education", "geo": "Atlanta GA US", "JobID": "406695"}, "203311": {"Content": "Title: User Support Specialist I\nRequirement:  Ability to work as a technical professional in a high-pressure law environment. Work overtime on demand. Present professional appearance and behavior. Willingness and desire to attend training classes to maintain technical skill sets. Ability to work effectively in a team environment. Excellent problem solving and troubleshooting skills. Provide 24 hour on-call emergency assistance on a rotational basis as dictated by Team Lead. Ability to bend, stoop, reach overhead, climb small ladder, crawl on hands and knees on the floor and under desks, lift or move up to 50 lbs.  Minimum 1 year technical training or 1 years hardware/software troubleshooting experience. ", "type": "Location", "Title": "User Support Specialist I", "geo": "Atlanta GA US", "JobID": "203311"}, "642706": {"Content": "Title: CHOA - Administrative Assistant\nRequirement:  Demonstrates competency as described in the Childrens Leadership Essentials. Practices proper safety techniques in accordance with hospital and departmental policies and procedures. Immediately reports any mechanical or electrical equipment malfunctions, employee/patient/visitor injuries or accidents, or other safety issues to supervisor or Compliance Office. Provides excellent service routinely in interactions with all customers i.e. coworkers, patients, visitors, physicians, volunteers, etc. Performs other duties and responsibilities as required. Performs various business-related functions as assigned.     MUST BE A NON-SMOKER CURRENTLY AND PASS A SCREENING MUST HAVE PROOF OF IMMUNITY FOR MEASLES/RUBELLA/MUMPS TB PPD TEST LESS THAN A YEAR VARICELLA HEPATITIS B VACCINE   ", "type": "Education", "Title": "CHOA - Administrative Assistant", "geo": "Atlanta GA US", "JobID": "642706"}, "44108": {"Content": "Title: Executive Assistant\nRequirement: Required Skills Advanced or expert in computer skills: Word, Excel, Outlook, PowerPoint. Experience in access database is a nice to have Excellent written and oral communication skills including superior grammar, spelling, and punctuation that enable the incumbent to work with top level management and other executive level clients Excellent organizational skills and detail oriented that enable efficient and effective multi-tasking Capable of managing highly confidential information Ability to work well with all levels of management as well as outside external clients and vendors  Team player who is willing to help out as needed  Ability to prioritize and work independently or with minimal supervision Required Experience A minimum of 5 years experience performing in a senior level support role  Project coordination experience a plus  Two year degree with concentration in Finance or Business, required; four year degree preferred. ", "type": "Education", "Title": "Executive Assistant", "geo": "Atlanta GA US", "JobID": "44108"}, "911679": {"Content": "Title: Sales Representative - Base Salary + Commission and Benefits\nRequirement: For consideration, please click \"Apply Now\" below or email Kevin Spargo at kspargo@ircdirect.comPlease include \"Atlanta-Uniform\" in the subject line of any emails", "type": "Education", "geo": "Atlanta GA US", "JobID": "911679"}, "784632": {"Content": "Title: Inside Sales Representative\nRequirement: Qualifications  Minimum of 4 years sales experience with at least 1 year of inside sales; this includes a proven track record of consultative selling, setting appointments, giving presentations and closing Results-oriented professionals with self confidence, perseverance, a sense of urgency and a dynamic personality Able to develop qualified leads, as well as continue existing client relationships Prior experience and achievement working in an organization that provides monthly and annual production targets based on individual performance quotas Excellent communication and presentation skills, including strong telephone and client communications - successful producers are proven to succeed on the phone! Recruiting experience and/or inside sales is strongly preferred but not required Must be confident, organized, and enthusiastic about our unique concept Must be able to work well in an independent environment and be held accountable for personal performance Must be a strong closer Able to pass a background and drug screen About Talagy We put talent in action. We deliver extraordinary recruiting services to employers and job seekers nationwide by putting people to work at all levels and industries. We offer a single point of contact for our clients while delivering outstanding candidates across a wide variety of disciplines. Whether you are the person we are looking for or an employer who needs great people, youve come to the right place. Lets work together.If you meet the requirements and are interested in the position, please send your resume to the following recruiter:claire.gardner@talagy.com ", "type": "Education", "Title": "Inside Sales Representative", "geo": "Atlanta GA US", "JobID": "784632"}, "334906": {"Content": "Title: Junior Marketing Account Managers - Entry Level\nRequirement: We are honored to be working with DIRECTV and are looking for the right individuals to work for us to professionally represent this large client.*Individuals must be hard working, motivated and willing to learn*Must have excellent communication skills, be goal-oriented and ambitious*Willing to be trained in sales, customer service, campaign management, test market development and public relationsIf youre ready for a challenging career,RAPID ADVANCEMENTand a team oriented environment,WE WANT TO HEAR FROM YOU!  POSITIONS ARE LIMITED.Management will review all resumes and contact those they feel are most qualified.___________________________________________Submit your resume to Jobs@fciweb.netFor More informationVisit our Website!Check us out on Facebook!Read our Latest Press Release ___________________________________________ **PLEASE NOTE:This is not a Graphic Design or Creative or Telemarketing Position. This position starts ENTRY LEVEL with the ability to rapidly advance into a management position.  2010 DIRECTV, Inc. DIRECTV, and the Cyclone Design logo are trademarks of DIRECTV, Inc. All other trademarks and service marks are property of their respective owners. apply if you have any of the following experience /related keywords: entry level, management, entry level management, entry level marketing, marketing, business development, entry level, customer service, sports minded, entertainment, advertising, public relations, management, sales, training, marketing, public relations, entry level, customer service, retail, restaurant experience, entry level, full time, internship, management, advertising, public relations, entry level, public relations, business, marketing, entry-level, promotions, direct marketing, promotional sales, business development, entertainment, sales - marketing, management, clients, account manager, campaigns, marketing, direct advertising, client relations, retail, marketing, experience, college graduates, internship, entry level, management, entry level management, entry level marketing, marketing, business development, entry level, customer service, sports, entertainment, advertising, public relations, management, sales, training, marketing, public relations, entry level, customer service, retail, restaurant, entry level, full time, internship, management, advertising, public relations ", "type": "Education", "Title": "Junior Marketing Account Managers - Entry Level", "geo": "Atlanta GA US", "JobID": "334906"}}